tutorials/pitzDaily/pitzDaily/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.0206 -0.03 -0.002)     //0
    (0.29 -0.03 -0.002)      //1
    (0.29 0.03 -0.002)       //2
    (-0.0206 0.03 -0.002)      //3

    (-0.0206 -0.03 0.002)     //0
    (0.29 -0.03 0.002)      //1
    (0.29 0.03 0.002)       //2
    (-0.0206 0.03 0.002)      //3
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (180 34 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch top
    (
        (3 7 6 2)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (2 6 5 1)
    )
    patch bottom
    (
        (1 5 4 0)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
